from colorama import Fore
banner_main = f"""
{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⠀⠀⣠⣤⡦⣤⣬⣍⡉⠒⢤⡀⠀⠀⠀⠀⠀⠀⠀        {Fore.BLUE}(BlackCode){Fore.LIGHTMAGENTA_EX}⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⣠⠒⠉⠁⠀⠀⠀⠀⠈⠙⠻⣦⣜⠳⣄⢀⣀⣀⣠⣄⣀⣀⣀⡀⠀⠀{Fore.LIGHTCYAN_EX}Github: https://github.com/nullBlackCode{Fore.LIGHTMAGENTA_EX}
⠀⡜⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⢿⡖⠛⣯⠀⠀⣀⣀⣀⣀⡀⠈⠉⠓⠒⠠⠤⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.BLUE}⣼⣯{Fore.LIGHTMAGENTA_EX}⠙⣦⠀
⣼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⠞⠃⣤⣽⣶⠾⣿⠉⠉⠉⠉⠉⠉⠙⠓⢤⡀⠀⠀⠀⠉⠙⠒⠶⢤⣤⣀⡀⠀⠀⠀⠀{Fore.BLUE}⠨⠍{Fore.LIGHTMAGENTA_EX}⢀⡾⠃
⢿⠀⠀⠀⠀⠀⠀⠀⠀⡠⠊⣠⣶⣿⠋⠉⣏⠀⢹⡀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠣⡀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠛⠓⠲⠖⠚⠉⠀⠀
⠘⣆{Fore.BLUE}⢀⣤⡀{Fore.LIGHTMAGENTA_EX}⠀⠀⠀⡼⢥⣶⠿⠙⠀⠀⠀⡇⠀⢸⡇⠀⠀⠀⠀{Fore.BLUE}⢠⣦⣤{Fore.LIGHTMAGENTA_EX}⠀⠀⠀⢹⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠈{Fore.BLUE}⠻⣿⡟{Fore.LIGHTMAGENTA_EX}⠀⠀⣾⣽⡿⠏⠁⠀⠀⠀⡸⠁⠀⣾⠀⠀⠀⠀⠀{Fore.BLUE}⢯⠙⠃{Fore.LIGHTMAGENTA_EX}⠀⠀⠀⣸⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⣑⣿⡟⠃⠀⠀⠀⠀⡴⠁⠀⣰⠏⠃⠀⠀⠀⠀⠘⢦⣄⣀⣠⡴⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢀⠀⢀⣾⠟⠐⢲⡷⠶⢶⡞⠁⠀⣴⠟⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀{Fore.BLUE}⢰⢿⡿{Fore.LIGHTMAGENTA_EX}⣾⡏⠀⠀⠀⠁⢰⠏⠀⢀⡾⡉⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠸⣌⢠⡿⠄⠀⢀⣠⡶⠁⠀⡰⠏⠁⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}⠀(1) > Crack tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⠈⣿⡟⠛⠋⢡⠞⠀⣠⠞⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}⠀(2) > Web tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⢀⢠⡟⠀⠀⢠⠃⠀⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}⠀(3) > Malware tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⡎⢸⠇⠀⠀⡏⠀⠀⠀⠀{Fore.BLUE}⣴⣗⠲⢤{Fore.LIGHTMAGENTA_EX}⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}⠀(4) > IP tools{Fore.LIGHTMAGENTA_EX}
⠀⢀⡇⣼⠀⠀⢸⡇⠀⠀⠀{Fore.BLUE}⠈⠛⠿⠃{Fore.LIGHTMAGENTA_EX}⠘⣧       {Fore.LIGHTRED_EX}(5) > Create wordlist{Fore.LIGHTMAGENTA_EX}
⠀⠘⡇⣧⠀⠀⠀⢷⡀⠀⠀⠀⠀⠀⢀⡼⠁⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}(6) > Network tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⡇⢸⠀⠀⠀⠈⠻⢶⣤⣤⣤⠶⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}(7) > Domain tools
⠀⠀⢃⠸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ {Fore.LIGHTRED_EX}(8) > Hash tools
⠀⠀⢸⠀⢧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}(9) > Payload generator{Fore.LIGHTMAGENTA_EX}
⠀⠀⠸⡄⠘⣆⠀⠀{Fore.BLUE}⣰⣦⡄{Fore.LIGHTMAGENTA_EX}             {Fore.LIGHTRED_EX}(10) > Stegano tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⢧⠀⠉⠳⢤{Fore.BLUE}⣽⡿⠙{Fore.LIGHTMAGENTA_EX}             {Fore.LIGHTRED_EX}(11) > Encoder{Fore.LIGHTMAGENTA_EX}
⠀⠀⢀⠸⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTRED_EX}(12) > OSINT tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⠸⡆⢳⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀  {Fore.LIGHTRED_EX}(13) > DDoS and DoS{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⢸⡘⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ {Fore.LIGHTRED_EX}(14) > WiFi Tools{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⠀⢧⢸⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠸⡄⢿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢇⠘⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢸⠀⢹⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠸⡄⠀⢷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀------------------
⠀⠀{Fore.BLUE}⠀⣠⡀{Fore.LIGHTMAGENTA_EX}⠈⡇⠀⢸⡇              {Fore.LIGHTRED_EX}(15) Setting{Fore.LIGHTMAGENTA_EX}
⠀⠀{Fore.BLUE}⢸⢿⠇{Fore.LIGHTMAGENTA_EX}⠀⡇⠀⣸⡇              {Fore.LIGHTRED_EX}(16) Proxy config{Fore.LIGHTMAGENTA_EX}
⠀⠀⠸⣄⣀⢰⣧⣴⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ------------------
⠀⠀⠀⠈⠙⢻⣿⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⣼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⢀⡿⠤⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢀⣠⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⢸⠿⠁⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⢰⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⡿⠐⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢸⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⡞⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠰⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⢫⠀⠀⠀⠀⠀⠀⠀⠀⠀{Fore.LIGHTYELLOW_EX}(q) EXIT{Fore.LIGHTMAGENTA_EX}
⠀⠀⠘⡄⠀⠀{Fore.BLUE}⢀⣤⣀{Fore.LIGHTMAGENTA_EX}
⠀⠀⠀⠘⠢⣀{Fore.BLUE}⣘⣿⠋{Fore.LIGHTMAGENTA_EX}

"""